app/views/recipe_lists/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "list_items" ON "recipes"."id" = "list_items"."recipe_id" WHERE "list_items"."recipe_list_id" = ?  [["recipe_list_id", 1]]
SELECT  1 AS one FROM "recipes" INNER JOIN "list_items" ON "recipes"."id" = "list_items"."recipe_id" WHERE "list_items"."recipe_list_id" = ? LIMIT ?  [["recipe_list_id", 1], ["LIMIT", 1]]
---
<h2><%= @recipe_list.name %></h2>
<% if @recipe_list.recipes.empty? %>

SELECT "recipes".* FROM "recipes" INNER JOIN "list_items" ON "recipes"."id" = "list_items"."recipe_id" WHERE "list_items"."recipe_list_id" = ?  [["recipe_list_id", 1]]
---
<% end %>
<% @recipe_list.recipes.each do |recipe| %>