app/controllers/cuisines_controller.rb

INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Brasileira"], ["created_at", "2019-08-26 01:20:25.049002"], ["updated_at", "2019-08-26 01:20:25.049002"]]
---
  def create
    @cuisine = Cuisine.new(set_params)
    if @cuisine.save

SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cuisine = Cuisine.find(params[:id])