app/controllers/recipes_controller.rb

  def search
    @recipes = Recipe.where("title LIKE ?", "%#{params[:term]}%")
    flash.now[:alert] = 'Receita não encontrada' if @recipes.empty?
---
SELECT "recipes".* FROM "recipes" WHERE (title LIKE '%Bolo%')
SELECT  1 AS one FROM "recipes" WHERE (title LIKE '%Bolo%') LIMIT ?  [["LIMIT", 1]]

  def show
    @list_item = ListItem.new
    @recipe_lists = RecipeList.where(user:current_user)
---
SELECT "recipe_lists".* FROM "recipe_lists" WHERE "recipe_lists"."user_id" = ?  [["user_id", 1]]

  def my
    @recipes = Recipe.where(user: current_user)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]

  def create
    @recipe = Recipe.new(set_params)
    @recipe.user = current_user
    return redirect_to @recipe if @recipe.save
---
INSERT INTO "recipes" ("title", "difficulty", "cook_time", "ingredients", "cook_method", "created_at", "updated_at", "recipe_type_id", "cuisine_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    return redirect_to @recipe  if @recipe.update(set_params)
---
UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Risotto veggie"], ["updated_at", "2019-08-26 04:35:56.209048"], ["id", 8]]

  def add_to_list
    @list_item = ListItem.new(params.require(:list_item).permit(:recipe_list_id))
    @list_item.recipe = @recipe
    if @list_item.save
      flash[:notice] = 'Adicionado à lista com Sucesso'
    else
      @list_item.errors.full_messages.each do |error|
---
INSERT INTO "list_items" ("recipe_list_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["recipe_list_id", 1], ["recipe_id", 2], ["created_at", "2019-08-26 01:24:26.414368"], ["updated_at", "2019-08-26 01:24:26.414368"]]
SELECT  "list_items".* FROM "list_items" WHERE "list_items"."recipe_id" = ? AND "list_items"."recipe_list_id" = ? LIMIT ?  [["recipe_id", 2], ["recipe_list_id", 1], ["LIMIT", 1]]

  def remove_from_list
    recipe = Recipe.find(params[:recipe])
    recipe_list = RecipeList.find(params[:id])
    list_item = ListItem.find_by(recipe: recipe, recipe_list: recipe_list)
    redirect_to recipe_list_path if list_item.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "recipe_lists".* FROM "recipe_lists" WHERE "recipe_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "list_items".* FROM "list_items" WHERE "list_items"."recipe_id" = ? AND "list_items"."recipe_list_id" = ? LIMIT ?  [["recipe_id", 2], ["recipe_list_id", 1], ["LIMIT", 1]]
DELETE FROM "list_items" WHERE "list_items"."id" = ?  [["id", 1]]

  def find_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def set_collections
    @recipe_types = RecipeType.all
    @cuisines = Cuisine.all
---
SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"