app/controllers/recipe_types_controller.rb

  def create
    @recipe_type = RecipeType.new(set_params)
    if @recipe_type.save
---
INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sobremesa"], ["created_at", "2019-08-26 01:20:20.897604"], ["updated_at", "2019-08-26 01:20:20.897604"]]

  def show
    @recipe_type = RecipeType.find(params[:id])
---
SELECT  "recipe_types".* FROM "recipe_types" WHERE "recipe_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]