app/controllers/recipe_lists_controller.rb

  def index
    @recipe_lists = RecipeList.where(user: current_user)
---
SELECT "recipe_lists".* FROM "recipe_lists" WHERE "recipe_lists"."user_id" = ?  [["user_id", 1]]

  def create
    @recipe_list = RecipeList.new(params.require(:recipe_list).permit(:name))
    @recipe_list.user = current_user
    return redirect_to @recipe_list if @recipe_list.save
---
INSERT INTO "recipe_lists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "gostosuras"], ["user_id", 1], ["created_at", "2019-08-26 01:24:13.425304"], ["updated_at", "2019-08-26 01:24:13.425304"]]

  def show
    @recipe_list = RecipeList.find(params[:id])
---
SELECT  "recipe_lists".* FROM "recipe_lists" WHERE "recipe_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]